using System.Windows.Forms;

namespace Lesson2
{
    public class Program
    {
        public static void Main(string[] args)
        {
            /*
             * Соколовский Дмитрий
             */

            /*
             * Первое задание:
             * Добавить космический корабль
             */

            /*
             * Второе задание:
             * а) Добавить в игру “Астероиды” ведение журнала в консоль с помощью делегатов
             * б) и в файл.
             */

            /* Третье задание:
             * Добавить аптечки, которые добавляют энергии
             */

            /* Четвертое задание:
             * Добавить подсчет очков за сбитые астероиды
             */

            /* Пятое задание:
             * Добавить в пример Lesson3 обобщенный делегат
             */
            Application.Run(new GameForm());
        }
    }
}